odoo-19.0+e.20260101/odoo/addons/l10n_pe_edi/tests/test_files/invoice_final_downpayment.xml

<Invoice xmlns="urn:oasis:names:specification:ubl:schema:xsd:Invoice-2"
    xmlns:cbc="urn:oasis:names:specification:ubl:schema:xsd:CommonBasicComponents-2"
    xmlns:cac="urn:oasis:names:specification:ubl:schema:xsd:CommonAggregateComponents-2"
    xmlns:ds="http://www.w3.org/2000/09/xmldsig#"
    xmlns:ext="urn:oasis:names:specification:ubl:schema:xsd:CommonExtensionComponents-2">
    <ext:UBLExtensions>
        <ext:UBLExtension>
            <ext:ExtensionContent>
                <ds:Signature Id="placeholder"/>
            </ext:ExtensionContent>
        </ext:UBLExtension>
    </ext:UBLExtensions>
    <cbc:UBLVersionID>2.1</cbc:UBLVersionID>
    <cbc:CustomizationID>2.0</cbc:CustomizationID>
    <cbc:ID>___ignore___</cbc:ID>
    <cbc:IssueDate>2017-01-01</cbc:IssueDate>
    <cbc:DueDate>2017-01-01</cbc:DueDate>
    <cbc:InvoiceTypeCode listID="0101" listAgencyName="PE:SUNAT" listName="Tipo de Documento" listURI="urn:pe:gob:sunat:cpe:see:gem:catalogos:catalogo01">01</cbc:InvoiceTypeCode>
    <cbc:Note languageLocaleID="1000">ONCE MIL QUINIENTOS SETENTA Y 00/100 SOLES</cbc:Note>
    <cbc:DocumentCurrencyCode>PEN</cbc:DocumentCurrencyCode>
    <cac:OrderReference>
        <cbc:ID>___ignore___</cbc:ID>
        <cbc:SalesOrderID>___ignore___</cbc:SalesOrderID>
    </cac:OrderReference>
    <cac:AdditionalDocumentReference>
        <cbc:ID>___ignore___</cbc:ID>
        <cbc:DocumentTypeCode>02</cbc:DocumentTypeCode>
        <cbc:DocumentStatusCode>1</cbc:DocumentStatusCode>
        <cac:IssuerParty>
            <cac:PartyIdentification>
                <cbc:ID schemeID="6">20557912879</cbc:ID>
            </cac:PartyIdentification>
        </cac:IssuerParty>
    </cac:AdditionalDocumentReference>
    <cac:AdditionalDocumentReference>
        <cbc:ID>___ignore___</cbc:ID>
        <cbc:DocumentTypeCode>02</cbc:DocumentTypeCode>
        <cbc:DocumentStatusCode>2</cbc:DocumentStatusCode>
        <cac:IssuerParty>
            <cac:PartyIdentification>
                <cbc:ID schemeID="6">20557912879</cbc:ID>
            </cac:PartyIdentification>
        </cac:IssuerParty>
    </cac:AdditionalDocumentReference>
    <cac:Signature>
        <cbc:ID>IDSignKG</cbc:ID>
        <cac:SignatoryParty>
            <cac:PartyIdentification>
                <cbc:ID>20557912879</cbc:ID>
            </cac:PartyIdentification>
            <cac:PartyName>
                <cbc:Name>COMPANY_1_DATA</cbc:Name>
            </cac:PartyName>
        </cac:SignatoryParty>
        <cac:DigitalSignatureAttachment>
            <cac:ExternalReference>
                <cbc:URI>#SignVX</cbc:URI>
            </cac:ExternalReference>
        </cac:DigitalSignatureAttachment>
    </cac:Signature>
    <cac:AccountingSupplierParty>
        <cbc:CustomerAssignedAccountID>20557912879</cbc:CustomerAssignedAccountID>
        <cac:Party>
            <cac:PartyIdentification>
                <cbc:ID schemeID="6">20557912879</cbc:ID>
            </cac:PartyIdentification>
            <cac:PartyName>
                <cbc:Name>company_1_data</cbc:Name>
            </cac:PartyName>
            <cac:PostalAddress>
                <cac:Country>
                    <cbc:IdentificationCode>PE</cbc:IdentificationCode>
                    <cbc:Name>Peru</cbc:Name>
                </cac:Country>
            </cac:PostalAddress>
            <cac:PartyTaxScheme>
                <cbc:RegistrationName>company_1_data</cbc:RegistrationName>
                <cbc:CompanyID>20557912879</cbc:CompanyID>
                <cac:RegistrationAddress>
                    <cac:Country>
                        <cbc:IdentificationCode>PE</cbc:IdentificationCode>
                        <cbc:Name>Peru</cbc:Name>
                    </cac:Country>
                </cac:RegistrationAddress>
                <cac:TaxScheme>
                    <cbc:ID>NOT_EU_VAT</cbc:ID>
                </cac:TaxScheme>
            </cac:PartyTaxScheme>
            <cac:PartyLegalEntity>
                <cbc:RegistrationName>company_1_data</cbc:RegistrationName>
                <cbc:CompanyID>20557912879</cbc:CompanyID>
                <cac:RegistrationAddress>
                    <cbc:AddressTypeCode>0000</cbc:AddressTypeCode>
                    <cac:Country>
                        <cbc:IdentificationCode>PE</cbc:IdentificationCode>
                        <cbc:Name>Peru</cbc:Name>
                    </cac:Country>
                </cac:RegistrationAddress>
            </cac:PartyLegalEntity>
            <cac:Contact>
                <cbc:ID>___ignore___</cbc:ID>
                <cbc:Name>company_1_data</cbc:Name>
            </cac:Contact>
        </cac:Party>
    </cac:AccountingSupplierParty>
    <cac:AccountingCustomerParty>
        <cbc:AdditionalAccountID>6</cbc:AdditionalAccountID>
        <cac:Party>
            <cac:PartyIdentification>
                <cbc:ID schemeID="6">20462509236</cbc:ID>
            </cac:PartyIdentification>
            <cac:PartyName>
                <cbc:Name>partner_a</cbc:Name>
            </cac:PartyName>
            <cac:PostalAddress>
                <cac:Country>
                    <cbc:IdentificationCode>PE</cbc:IdentificationCode>
                    <cbc:Name>Peru</cbc:Name>
                </cac:Country>
            </cac:PostalAddress>
            <cac:PartyTaxScheme>
                <cbc:RegistrationName>partner_a</cbc:RegistrationName>
                <cbc:CompanyID>20462509236</cbc:CompanyID>
                <cac:RegistrationAddress>
                    <cac:Country>
                        <cbc:IdentificationCode>PE</cbc:IdentificationCode>
                        <cbc:Name>Peru</cbc:Name>
                    </cac:Country>
                </cac:RegistrationAddress>
                <cac:TaxScheme>
                    <cbc:ID>NOT_EU_VAT</cbc:ID>
                </cac:TaxScheme>
            </cac:PartyTaxScheme>
            <cac:PartyLegalEntity>
                <cbc:RegistrationName>partner_a</cbc:RegistrationName>
                <cbc:CompanyID>20462509236</cbc:CompanyID>
                <cac:RegistrationAddress>
                    <cac:Country>
                        <cbc:IdentificationCode>PE</cbc:IdentificationCode>
                        <cbc:Name>Peru</cbc:Name>
                    </cac:Country>
                </cac:RegistrationAddress>
            </cac:PartyLegalEntity>
            <cac:Contact>
                <cbc:ID>___ignore___</cbc:ID>
                <cbc:Name>partner_a</cbc:Name>
            </cac:Contact>
        </cac:Party>
    </cac:AccountingCustomerParty>
    <cac:Delivery>
        <cac:DeliveryLocation>
            <cac:Address>
                <cac:Country>
                    <cbc:IdentificationCode>PE</cbc:IdentificationCode>
                    <cbc:Name>Peru</cbc:Name>
                </cac:Country>
            </cac:Address>
        </cac:DeliveryLocation>
    </cac:Delivery>
    <cac:PaymentTerms>
        <cbc:ID>FormaPago</cbc:ID>
        <cbc:PaymentMeansID>Contado</cbc:PaymentMeansID>
    </cac:PaymentTerms>
    <cac:PrepaidPayment>
        <cbc:ID>1</cbc:ID>
        <cbc:PaidAmount currencyID="PEN">115.00</cbc:PaidAmount>
    </cac:PrepaidPayment>
    <cac:PrepaidPayment>
        <cbc:ID>2</cbc:ID>
        <cbc:PaidAmount currencyID="PEN">115.00</cbc:PaidAmount>
    </cac:PrepaidPayment>
    <cac:AllowanceCharge>
        <cbc:ChargeIndicator>false</cbc:ChargeIndicator>
        <cbc:AllowanceChargeReasonCode>04</cbc:AllowanceChargeReasonCode>
        <cbc:MultiplierFactorNumeric>0.00965</cbc:MultiplierFactorNumeric>
        <cbc:Amount currencyID="PEN">97.46</cbc:Amount>
        <cbc:BaseAmount currencyID="PEN">10097.46</cbc:BaseAmount>
    </cac:AllowanceCharge>
    <cac:AllowanceCharge>
        <cbc:ChargeIndicator>false</cbc:ChargeIndicator>
        <cbc:AllowanceChargeReasonCode>04</cbc:AllowanceChargeReasonCode>
        <cbc:MultiplierFactorNumeric>0.00956</cbc:MultiplierFactorNumeric>
        <cbc:Amount currencyID="PEN">97.46</cbc:Amount>
        <cbc:BaseAmount currencyID="PEN">10194.92</cbc:BaseAmount>
    </cac:AllowanceCharge>
    <cac:TaxTotal>
        <cbc:TaxAmount currencyID="PEN">1764.92</cbc:TaxAmount>
        <cac:TaxSubtotal>
            <cbc:TaxableAmount currencyID="PEN">9805.08</cbc:TaxableAmount>
            <cbc:TaxAmount currencyID="PEN">1764.92</cbc:TaxAmount>
            <cac:TaxCategory>
                <cac:TaxScheme>
                    <cbc:ID>1000</cbc:ID>
                    <cbc:Name>IGV</cbc:Name>
                    <cbc:TaxTypeCode>VAT</cbc:TaxTypeCode>
                </cac:TaxScheme>
            </cac:TaxCategory>
        </cac:TaxSubtotal>
    </cac:TaxTotal>
    <cac:LegalMonetaryTotal>
        <cbc:LineExtensionAmount currencyID="PEN">10000.00</cbc:LineExtensionAmount>
        <cbc:TaxExclusiveAmount currencyID="PEN">10000.00</cbc:TaxExclusiveAmount>
        <cbc:TaxInclusiveAmount currencyID="PEN">11800.00</cbc:TaxInclusiveAmount>
        <cbc:PrepaidAmount currencyID="PEN">230.00</cbc:PrepaidAmount>
        <cbc:PayableAmount currencyID="PEN">11570.00</cbc:PayableAmount>
    </cac:LegalMonetaryTotal>
    <cac:InvoiceLine>
        <cbc:ID>___ignore___</cbc:ID>
        <cbc:InvoicedQuantity unitCode="KGM">5.0</cbc:InvoicedQuantity>
        <cbc:LineExtensionAmount currencyID="PEN">10000.00</cbc:LineExtensionAmount>
        <cac:PricingReference>
            <cac:AlternativeConditionPrice>
                <cbc:PriceAmount currencyID="PEN">2360.00</cbc:PriceAmount>
                <cbc:PriceTypeCode>01</cbc:PriceTypeCode>
            </cac:AlternativeConditionPrice>
        </cac:PricingReference>
        <cac:TaxTotal>
            <cbc:TaxAmount currencyID="PEN">1800.00</cbc:TaxAmount>
            <cac:TaxSubtotal>
                <cbc:TaxableAmount currencyID="PEN">10000.00</cbc:TaxableAmount>
                <cbc:TaxAmount currencyID="PEN">1800.00</cbc:TaxAmount>
                <cac:TaxCategory>
                    <cbc:Percent>18.0</cbc:Percent>
                    <cbc:TaxExemptionReasonCode>10</cbc:TaxExemptionReasonCode>
                    <cac:TaxScheme>
                        <cbc:ID>1000</cbc:ID>
                        <cbc:Name>IGV</cbc:Name>
                        <cbc:TaxTypeCode>VAT</cbc:TaxTypeCode>
                    </cac:TaxScheme>
                </cac:TaxCategory>
            </cac:TaxSubtotal>
        </cac:TaxTotal>
        <cac:Item>
            <cbc:Description>product_pe</cbc:Description>
            <cbc:Name>product_pe</cbc:Name>
            <cac:CommodityClassification>
                <cbc:ItemClassificationCode>01010101</cbc:ItemClassificationCode>
            </cac:CommodityClassification>
        </cac:Item>
        <cac:Price>
            <cbc:PriceAmount currencyID="PEN">2000.0</cbc:PriceAmount>
        </cac:Price>
    </cac:InvoiceLine>
</Invoice>
